In [19]:
import numpy as np
import pandas as pd

In [20]:
dict1 = {
    "name" : ['Aditya','Rohan','Skillf','Shubh'],
    "marks" : [78,56,22,11],
    "city" : ["Siliguri","Jalpaiguri","Malda","Kolkata"]
}

In [21]:
df = pd.DataFrame(dict1)
df

     name  marks        city
0  Aditya     78    Siliguri
1   Rohan     56  Jalpaiguri
2  Skillf     22       Malda
3   Shubh     11     Kolkata

In [22]:
df.to_csv('friends.csv')

In [23]:
df.to_csv('friends_index_false.csv',index=False)

In [24]:
df.head(2)

     name  marks        city
0  Aditya     78    Siliguri
1   Rohan     56  Jalpaiguri

In [25]:
df.tail(2)

     name  marks     city
2  Skillf     22    Malda
3   Shubh     11  Kolkata

In [26]:
df.describe()

           marks
count   4.000000
mean   41.750000
std    30.836937
min    11.000000
25%    19.250000
50%    39.000000
75%    61.500000
max    78.000000

In [27]:
readCsv = pd.read_csv('friends.csv')

In [28]:
readCsv

   Unnamed: 0    name  marks        city
0           0  Aditya     78    Siliguri
1           1   Rohan     56  Jalpaiguri
2           2  Skillf     22       Malda
3           3   Shubh     11     Kolkata

In [29]:
readCsv['marks']

0    78
1    56
2    22
3    11
Name: marks, dtype: int64

In [30]:
readCsv['marks'][0] = 90

C:\Users\as167\AppData\Local\Temp\ipykernel_1436\277559976.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  readCsv['marks'][0] = 90

In [31]:
readCsv.to_csv('modify.csv')

In [32]:
readCsv.index = ['first','second','third','fourth']

In [33]:
readCsv

        Unnamed: 0    name  marks        city
first            0  Aditya     90    Siliguri
second           1   Rohan     56  Jalpaiguri
third            2  Skillf     22       Malda
fourth           3   Shubh     11     Kolkata

In [36]:
ser = pd.Series(np.random.rand(34))

In [38]:
type(ser)

pandas.core.series.Series

In [45]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [46]:
newdf

            0         1         2         3         4
0    0.668225  0.373167  0.984890  0.638374  0.527559
1    0.900700  0.135465  0.156366  0.614674  0.431681
2    0.955560  0.312437  0.033342  0.898731  0.713390
3    0.887513  0.824431  0.824303  0.736842  0.179929
4    0.452951  0.359239  0.746181  0.668290  0.280797
..        ...       ...       ...       ...       ...
329  0.215840  0.969948  0.957565  0.392553  0.543033
330  0.498115  0.117756  0.039315  0.760463  0.564790
331  0.455817  0.523791  0.710259  0.615974  0.096036
332  0.298647  0.810011  0.018125  0.863259  0.121079
333  0.435040  0.949015  0.435640  0.990003  0.108282

[334 rows x 5 columns]

In [47]:
type(newdf)

pandas.core.frame.DataFrame

In [48]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.481347    0.474933    0.507019    0.494241    0.468076
std      0.285701    0.282293    0.287112    0.290967    0.296900
min      0.000676    0.000907    0.002487    0.000312    0.000102
25%      0.240828    0.230730    0.266090    0.254447    0.198480
50%      0.465439    0.469034    0.513085    0.479407    0.444927
75%      0.731164    0.709353    0.739301    0.769941    0.737596
max      0.997220    0.983379    0.987987    0.997133    0.981135

In [49]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [50]:
newdf.head()

          0         1         2         3         4
0  0.668225  0.373167  0.984890  0.638374  0.527559
1  0.900700  0.135465  0.156366  0.614674  0.431681
2  0.955560  0.312437  0.033342  0.898731  0.713390
3  0.887513  0.824431  0.824303  0.736842  0.179929
4  0.452951  0.359239  0.746181  0.668290  0.280797

In [51]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [52]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [53]:
newdf.to_numpy()

array([[0.66822455, 0.37316652, 0.98489009, 0.6383745 , 0.52755925],
       [0.90069972, 0.13546517, 0.15636595, 0.61467419, 0.43168082],
       [0.95556021, 0.31243698, 0.03334227, 0.89873117, 0.71338959],
       ...,
       [0.45581686, 0.52379111, 0.71025948, 0.61597438, 0.09603633],
       [0.29864679, 0.81001097, 0.01812529, 0.86325948, 0.12107931],
       [0.43504012, 0.94901521, 0.43564022, 0.99000275, 0.10828178]])

In [54]:
newdf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
333  0.435040  0.949015  0.435640  0.990003  0.108282
332  0.298647  0.810011  0.018125  0.863259  0.121079
331  0.455817  0.523791  0.710259  0.615974  0.096036
330  0.498115  0.117756  0.039315  0.760463  0.564790
329  0.215840  0.969948  0.957565  0.392553  0.543033
..        ...       ...       ...       ...       ...
4    0.452951  0.359239  0.746181  0.668290  0.280797
3    0.887513  0.824431  0.824303  0.736842  0.179929
2    0.955560  0.312437  0.033342  0.898731  0.713390
1    0.900700  0.135465  0.156366  0.614674  0.431681
0    0.668225  0.373167  0.984890  0.638374  0.527559

[334 rows x 5 columns]

In [55]:
newdf.loc[0,0] = 654

In [56]:
newdf.head(2)

          0         1         2         3         4
0  654.0000  0.373167  0.984890  0.638374  0.527559
1    0.9007  0.135465  0.156366  0.614674  0.431681

In [57]:
newdf.columns = list("ABCDE")

In [58]:
newdf.head()

            A         B         C         D         E
0  654.000000  0.373167  0.984890  0.638374  0.527559
1    0.900700  0.135465  0.156366  0.614674  0.431681
2    0.955560  0.312437  0.033342  0.898731  0.713390
3    0.887513  0.824431  0.824303  0.736842  0.179929
4    0.452951  0.359239  0.746181  0.668290  0.280797

In [59]:
newdf.loc[0,'A'] = 54

In [60]:
newdf.loc[[1,2],['C','D']]

          C         D
1  0.156366  0.614674
2  0.033342  0.898731

In [62]:
newdf.loc[(newdf['A']<0.3)]

            A         B         C         D         E
5    0.224411  0.428162  0.891536  0.774268  0.563816
9    0.037799  0.211287  0.740593  0.865992  0.499979
13   0.145675  0.679865  0.588735  0.964252  0.274742
14   0.094161  0.569520  0.829421  0.394407  0.007534
18   0.220361  0.780803  0.946236  0.997133  0.357058
..        ...       ...       ...       ...       ...
307  0.186050  0.165407  0.628313  0.837331  0.155237
316  0.041228  0.116184  0.148132  0.391107  0.550072
318  0.041842  0.019499  0.715896  0.054333  0.010898
329  0.215840  0.969948  0.957565  0.392553  0.543033
332  0.298647  0.810011  0.018125  0.863259  0.121079

[111 rows x 5 columns]

In [63]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.3)]

            A         B         C         D         E
5    0.224411  0.428162  0.891536  0.774268  0.563816
9    0.037799  0.211287  0.740593  0.865992  0.499979
13   0.145675  0.679865  0.588735  0.964252  0.274742
14   0.094161  0.569520  0.829421  0.394407  0.007534
18   0.220361  0.780803  0.946236  0.997133  0.357058
..        ...       ...       ...       ...       ...
290  0.103856  0.433886  0.750488  0.979968  0.864679
306  0.276793  0.467078  0.816612  0.606498  0.015754
307  0.186050  0.165407  0.628313  0.837331  0.155237
318  0.041842  0.019499  0.715896  0.054333  0.010898
329  0.215840  0.969948  0.957565  0.392553  0.543033

[77 rows x 5 columns]

In [64]:
newdf.head(2)

         A         B         C         D         E
0  54.0000  0.373167  0.984890  0.638374  0.527559
1   0.9007  0.135465  0.156366  0.614674  0.431681

In [65]:
newdf.iloc[0,4]

0.5275592547521134